In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df =  pd.read_csv("data/heights.csv")

In [5]:
df.head()

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [14]:
# quantile will give us the height of 95 percentile i.e the tallest man will have the percentile of 100 then followed by the decreasing
# heights

max_threshold= df["height"].quantile(0.95)

In [18]:
# lets find out how many people are above the max threshold

df[df["height"] > max_threshold]

    name  height
9  imran    14.5

In [19]:
# As we can see that 14 feet cannot be a natureal height so it is an outlier

In [21]:
# Now on the similar basis lets find the minimum height outlier

min_threshold = df["height"].quantile(0.05)

In [23]:
print(min_threshold)

3.6050000000000004

In [25]:
df[df["height"]<min_threshold]

      name  height
12  yoseph     1.2

In [27]:
# how lets drop/ exclude the outlier and create a new data frame without outliers

df2 = df[(df["height"]>min_threshold) & (df["height"]<max_threshold)]

In [28]:
df2

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

In [29]:
# Now lets deal with some big data

In [32]:
df = pd.read_csv("data/bhp.csv")
df.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13200 entries, 0 to 13199
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        13200 non-null  object
 1   size            13200 non-null  object
 2   total_sqft      13200 non-null  float64
 3   bath            13200 non-null  float64
 4   price           13200 non-null  float64
 5   bhk             13200 non-null  int64
 6   price_per_sqft  13200 non-null  int64
dtypes: float64(3), int64(2), object(2)
memory usage: 722.0+ KB

In [34]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [35]:
df.columns

Index(['location', 'size', 'total_sqft', 'bath', 'price', 'bhk',
       'price_per_sqft'],
      dtype='object')

In [37]:
df.shape

(13200, 7)

In [53]:
check = df.groupby("bath")["bhk"].sum()

In [54]:
print(check)

bath
1.0       964
2.0     15401
3.0     10068
4.0      4796
5.0      2342
6.0      1480
7.0       690
8.0       489
9.0       349
10.0      120
11.0       30
12.0       64
13.0       32
14.0        9
15.0       14
16.0       35
18.0       18
27.0       27
40.0       43
Name: bhk, dtype: int64

In [56]:
# now lets find the min and max threshold in this dataset

min_threshold, max_threshold = df["price_per_sqft"].quantile([0.001,0.999])

In [57]:
print("min is",min_threshold)
print("max is",max_threshold)

min is 1366.184
max is 50959.36200000098

In [58]:
# So as of now any property that have price per sqft below minimum threshold and above max threshold will be considered an outlier

In [59]:
# lets create a dataset without these outliers

df2 = df[(df["price_per_sqft"]>min_threshold) & (df["price_per_sqft"]<max_threshold)]

In [60]:
df2.shape

(13172, 7)

In [63]:
# As we can see that some rows are removed and the numbers is

print("rows removed =",13200-13172)

rows removed = 28